Catalogs/КонтрольПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>КонтрольПродаж</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключенВРМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехТорговыхОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсейНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палитра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПалитраТоваровРМК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппыТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПалитрыКонтроляПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Палитра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПалитраТоваровРМК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НоменклатураРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТорговыеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговыйОбъект</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКонтроля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтроля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДниНеделиРМК</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапретПодбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретВидаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретРучнойСкидки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСотрудникомНаКСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольОстатков</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КонтрольПродаж/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Локальный = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	ПрочитатьЗначениеИспользования();
	НастроитьДоступностьФормы();
	ЗаполнитьТипыКонтроля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если КонтрольПродажЗаполненКорректно() Тогда
		Если Объект.Локальный Тогда
			ТекущийОбъект.Использование = ИспользованиеЛокально;
		ИначеЕсли Объект.Использование Тогда
			ТекущийОбъект.ВключенВРМК = ИспользованиеЛокально;
		КонецЕсли;
		АктуализироватьСписокПалитр(ТекущийОбъект);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДляВсехТорговыхОбъектовПриИзменении(Элемент)
	
	Если Объект.ДляВсехТорговыхОбъектов И Объект.ТорговыеОбъекты.Количество() > 0 Тогда
		ПодтвердитьОчисткуМагазиновПриВключенииПризнака();
	Иначе
		НастроитьДоступностьТаблицыМагазинов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДляВсейНоменклатурыПриИзменении(Элемент)
	
	Если Объект.ДляВсейНоменклатуры И (Объект.Номенклатура.Количество() > 0 Или ЗначениеЗаполнено(Объект.Палитра)) Тогда
		ПодтвердитьОчисткуСпискаТоваровПриВключенииПризнака();
	Иначе
		НастроитьДоступностьТаблицыНоменклатуры();
		НастроитьДоступностьПалитры();
		НастроитьДоступностьПечатиСоставаПалитры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПалитраПриИзменении(Элемент)
	
	НастроитьДоступностьТаблицыНоменклатуры();
	НастроитьДоступностьПечатиСоставаПалитры();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НастроитьДоступностьПалитры();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыКонтрольПродаж

&НаКлиенте
Процедура КонтрольПродажПриАктивизацииСтроки(Элемент)
	
	НастроитьДоступностьПолейВремени();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольПродажВидКонтроляПриИзменении(Элемент)
	
	УстановитьТипКонтроляВСтроке();
	НастроитьДоступностьПолейВремени();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольПродажПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		НастроитьДоступностьПолейВремени();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуПодбораНоменклатуры(Команда)
	
	ЗаголовокФормыПодбора = СтрШаблон(НСтр("ru = 'Подбор товаров в контроль продаж %1'"),
			?(ЗначениеЗаполнено(Объект.Ссылка),
				Объект.Ссылка,
				НСтр("ru = ''")));
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ЗавершениеОбработкиПодбораТоваров", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заголовок", ЗаголовокФормыПодбора);
	ПараметрыОткрытия.Вставить("КлючУникальности", УникальныйИдентификатор);
	ОбщегоНазначенияРМККлиент.ЗаполнитьПараметрыОткрытияФормыПодбораНоменклатурыКонтроляПродаж(ПараметрыОткрытия);
	ОбщегоНазначенияРМККлиент.ОткрытьИнтерфейсПодбораНоменклатуры(ЭтотОбъект, ПараметрыОткрытия, ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетСоставПалитры(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Палитра", Объект.Палитра);
	ПараметрыОткрытия.Вставить("ВариантОтчета", "Основной");
	
	ОткрытьФорму("Отчет.СоставПалитры.Форма.ФормаОтчета", ПараметрыОткрытия, ЭтотОбъект,
		ЭтотОбъект.УникальныйИдентификатор, , , Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьЗначениеИспользования()
	
	Если АвтономнаяЛогикаИспользования Тогда
		ИспользованиеЛокально = (Объект.Использование И (Объект.ВключенВРМК Или Объект.Локальный));
		Элементы.ИспользованиеЛокально.Доступность = (Объект.Использование Или Объект.Локальный);
	Иначе
		ИспользованиеЛокально = Объект.Использование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьЭлементовФормы()
	
	НастроитьДоступностьТаблицыМагазинов();
	НастроитьДоступностьТаблицыНоменклатуры();
	НастроитьДоступностьПалитры();
	НастроитьДоступностьПечатиСоставаПалитры();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьТаблицыМагазинов()
	
	Элементы.СтраницаМагазины.Доступность = Не Объект.ДляВсехТорговыхОбъектов;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьТаблицыНоменклатуры()
	
	Элементы.Номенклатура.Доступность = Не (Объект.ДляВсейНоменклатуры Или ЗначениеЗаполнено(Объект.Палитра));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьПалитры()
	
	Элементы.Палитра.Доступность = Не (Объект.ДляВсейНоменклатуры Или Объект.Номенклатура.Количество() > 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОчисткуМагазиновПриВключенииПризнака()
	
	ПараметрыОповещения = Новый Структура("УстановкаПризнака", Истина);
	ОповещениеОтвета = Новый ОписаниеОповещения("ОбработкаОтветаОчисткиМагазинов", ЭтотОбъект, ПараметрыОповещения);
	ТекстВопроса = НСтр("ru = 'Список магазинов будет очищен. Продолжить?'");
	ПоказатьВопрос(ОповещениеОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОчисткиМагазинов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТорговыеОбъекты.Очистить();
		НастроитьДоступностьТаблицыМагазинов();
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("УстановкаПризнака")
			И ДополнительныеПараметры.УстановкаПризнака Тогда
		Объект.ДляВсехТорговыхОбъектов = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОчисткуСпискаТоваровПриВключенииПризнака()
	
	ПараметрыОповещения = Новый Структура("УстановкаПризнака", Истина);
	ОповещениеОтвета = Новый ОписаниеОповещения("ОбработкаОтветаОчисткиСпискаТоваров", ЭтотОбъект, ПараметрыОповещения);
	ТекстВопроса = НСтр("ru = 'Список товаров будет очищен. Продолжить?'");
	ПоказатьВопрос(ОповещениеОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОчисткиСпискаТоваров(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Объект.Номенклатура.Количество() > 0 Тогда
			Объект.Номенклатура.Очистить();
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Палитра) Тогда
			Объект.Палитра = Неопределено;
		КонецЕсли;
		НастроитьДоступностьТаблицыНоменклатуры();
		НастроитьДоступностьПалитры();
		НастроитьДоступностьПечатиСоставаПалитры();
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("УстановкаПризнака")
			И ДополнительныеПараметры.УстановкаПризнака Тогда
		Объект.ДляВсейНоменклатуры = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьСписокПалитр(ТекущийОбъект)
	
	ТекущийОбъект.ПалитрыКонтроляПродаж.Очистить();
	Если ЗначениеЗаполнено(Объект.Палитра) Тогда
		ИсходныйМассив = Новый Массив;
		ИсходныйМассив.Добавить(Объект.Палитра);
		ПодчиненныеПалитры = ИнтерфейсРМКСлужебный.ПолучитьВложенныеПалитры(ИсходныйМассив);
		НоваяСтрока = ТекущийОбъект.ПалитрыКонтроляПродаж.Добавить();
		НоваяСтрока.Палитра = Объект.Палитра;
		Для Каждого ЭлементПалитра Из ПодчиненныеПалитры Цикл
			НоваяСтрока = ТекущийОбъект.ПалитрыКонтроляПродаж.Добавить();
			НоваяСтрока.Палитра = ЭлементПалитра;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КонтрольПродажЗаполненКорректно()
	
	РезультатФункции = Истина;
	
	КоличествоСтрокКонтроля = Объект.КонтрольПродаж.Количество();
	ИндексКонтроля = 0;
	Пока ИндексКонтроля < КоличествоСтрокКонтроля И РезультатФункции Цикл
		СтрокаКонтроля = Объект.КонтрольПродаж.Получить(ИндексКонтроля);
		ТекстОшибки = "";
		ИмяКолонки = "";
		Если ЗначениеЗаполнено(СтрокаКонтроля.КонецПериода)
				И СтрокаКонтроля.НачалоПериода > СтрокаКонтроля.КонецПериода Тогда
				
			ТекстОшибки = НСтр("ru = 'Конец периода не может быть меньше начала периода.'");
			ИмяКолонки = "КонецПериода";
			РезультатФункции = Ложь;
			
		ИначеЕсли СтрокаКонтроля.ВремяНачала > СтрокаКонтроля.ВремяОкончания Тогда
			
			ТекстОшибки = НСтр("ru = 'Время начала не может быть больше времени окончания.'");
			ИмяКолонки = "ВремяНачала";
			РезультатФункции = Ложь;
			
		КонецЕсли;
		Если Не РезультатФункции Тогда
			ЧастьТекстаНомерСтроки = НСтр("ru = 'Неверно заполнена строка №'");
			ТекстНомераСтроки = СтрШаблон("%1 %2.", ЧастьТекстаНомерСтроки, Формат(ИндексКонтроля + 1, "ЧГ="));
			ТекстСообщения = СтрШаблон("%1%2%3", ТекстНомераСтроки, Символы.ПС, ТекстОшибки);
			ПолеОтображенияОшибки = СтрШаблон("Объект.КонтрольПродаж[%1].%2", Формат(ИндексКонтроля, "ЧГ="), ИмяКолонки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , ПолеОтображенияОшибки);
		КонецЕсли;
		
		ИндексКонтроля = ИндексКонтроля + 1;
	КонецЦикла;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура НастроитьДоступностьФормы()
	
	ТолькоДляПросмотра = Не Объект.Локальный;
	Элементы.Наименование.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.Описание.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.ДляВсехТорговыхОбъектов.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.ДляВсейНоменклатуры.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.Палитра.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.КонтрольПродаж.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.ТорговыеОбъекты.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.Номенклатура.ТолькоПросмотр = ТолькоДляПросмотра;
	Элементы.НаименованиеГруппыТоваров.ТолькоПросмотр = ТолькоДляПросмотра;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Для Каждого ЗначениеНоменклатуры Из ВыбранноеЗначение Цикл
		
		ОтборНоменклатуры = Новый Структура("Номенклатура", ЗначениеНоменклатуры);
		СуществующиеСтроки = Объект.Номенклатура.НайтиСтроки(ОтборНоменклатуры);
		Если СуществующиеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Номенклатура.Добавить();
			НоваяСтрока.номенклатура = ЗначениеНоменклатуры;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыКонтроля()
	
	ИспользуемыеВидыКонтроля = Новый Массив;
	Для Каждого СтрокаКонтроля Из Объект.КонтрольПродаж Цикл
		
		Если ЗначениеЗаполнено(СтрокаКонтроля.ВидКонтроля)
				И ИспользуемыеВидыКонтроля.Найти(СтрокаКонтроля.ВидКонтроля) = Неопределено Тогда
				
			ИспользуемыеВидыКонтроля.Добавить(СтрокаКонтроля.ВидКонтроля);
			
		КонецЕсли;
		
	КонецЦикла;
	ТипыВидовКонтроля = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ИспользуемыеВидыКонтроля, "ТипКонтроля");
	Для Каждого СтрокаКонтроля Из Объект.КонтрольПродаж Цикл
		Если ЗначениеЗаполнено(СтрокаКонтроля.ВидКонтроля) Тогда
			СтрокаКонтроля.ТипКонтроля = ТипыВидовКонтроля[СтрокаКонтроля.ВидКонтроля];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипКонтроляВСтроке()
	
	ТекущиеДанные = Элементы.КонтрольПродаж.ТекущиеДанные;
	ТипКонтроляСтроки = Неопределено;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидКонтроля) Тогда
		ТипКонтроляСтроки = ПолучитьТипКонтроляПоВидуКонтроля(ТекущиеДанные.ВидКонтроля);
	КонецЕсли;
	ТекущиеДанные.ТипКонтроля = ТипКонтроляСтроки;
	Если Не ТипКонтроляПоддерживаетВремя(ТипКонтроляСтроки) Тогда
		ТекущиеДанные.ВремяНачала = Дата(1, 1, 1, 0, 0, 0);
		ТекущиеДанные.ВремяОкончания = Дата(1, 1, 1, 0, 0, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипКонтроляПоВидуКонтроля(ВидКонтроля)
	
	РезультатФункции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКонтроля, "ТипКонтроля");
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция ТипКонтроляПоддерживаетВремя(ТипКонтроля)
	
	РезультатФункции = Ложь;
	
	Если ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ЗапретПодбора")
			Или ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.ПроверкаПокупателя")
			Или ТипКонтроля = ПредопределенноеЗначение("Перечисление.ТипыКонтроля.КонтрольСотрудникомНаКСО") Тогда
			
		РезультатФункции = Истина;
			
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура НастроитьДоступностьПолейВремени()
	
	ТекущиеДанные = Элементы.КонтрольПродаж.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		ТолькоПросмотрВремени = Истина;
		Если ТипКонтроляПоддерживаетВремя(ТекущиеДанные.ТипКонтроля) Тогда
			
			ТолькоПросмотрВремени = Ложь;
			
		КонецЕсли;
		Элементы.КонтрольПродажВремяНачала.ТолькоПросмотр = ТолькоПросмотрВремени;
		Элементы.КонтрольПродажВремяОкончания.ТолькоПросмотр = ТолькоПросмотрВремени;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьПечатиСоставаПалитры()
	
	Элементы.ОткрытьОтчетСоставПалитры.Доступность = ЗначениеЗаполнено(Объект.Палитра);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДобавлениеПоЗаполнению(Результат)
	
	ДанныеВыбора = ОбработатьПодборНаСервере(Результат);
	
	Если НЕ ДанныеВыбора = Неопределено Тогда
		
		Элементы.Номенклатура.ТекущаяСтрока = ДанныеВыбора.ИдентификаторПоследнегоВыбранногоЭлемента;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьПодборНаСервере(ВыбранноеЗначение)
	
	Результат = Неопределено;
	Позиции = ЗначенияПодбора(ВыбранноеЗначение);
	Если Позиции.Количество() > 0 Тогда
		Результат = Новый Структура();
		Для Каждого Позиция Из Позиции Цикл
		
			НовыйЭлемент = Объект.Номенклатура.Добавить();
			НовыйЭлемент.Номенклатура = Позиция.Номенклатура;
		
		КонецЦикла;
		Результат.Вставить("ИдентификаторПоследнегоВыбранногоЭлемента", НовыйЭлемент.ПолучитьИдентификатор());
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗначенияПодбора(ИсходныеДанные)

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура");
	
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьЗначенияПодбораДляПалитры(ИсходныеДанные, Результат);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ЗавершениеОбработкиПодбораТоваров(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ВыполнитьДобавлениеПоЗаполнению(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
